<h2>Soal 1: Pivoting and Melting</h2>

Jelaskan apa itu pivoting dan melting data

Jawaban:

Pivoting adalah suatu pengubahan bentuk data dengan memutar data yang terletak di baris menjadi di kolom. Pivoting melakukan perubahan pada bentuk data dari yang tadinya panjang menjadi lebar.

Melting adalah ‘unpivoting’, atau dengan kata lain mengubah suatu data dengan memutar dari yang tadinya berada di posisi kolom menjadi di posisi baris. Melting mengubah data yang tadinya lebar menjadi panjang.

<h2>Soal 2: Data structure Comprehension</h2>

Data yang rapi adalah:
1. Setiap row menunjukan suatu unit observasi
2. Setiap column merupakan suatu unit variable

Bagaimana pun, dalam menentukan unit observasi itu tergantung dari kasus yang di hadapi. sebagai seorang data scientist pasti akan menemukan berbagai bentuk struktur data. adalah sangat penting bagi seorang data scientist untuk dapat memahami dan menjelaskan setiap struktur data. Kemampuan memahami hubungan antara index baris, column dan isi data adalah kunci untuk memahami informasi apa yang data sedang beritahukan kepada kita.

Di bawah ini terdapat 2 data yang berisi sama, tetapi memiliki struktur yang berbeda. Jelaskan perbedaan dari 2 struktur data tersebut

![alt text](https://drive.google.com/uc?id=1h13CDPzIjc-2XyRcyu-p1fet0Ep1gdMA)

![alt text](https://drive.google.com/uc?id=12ji98ell5tNcCxeBzl4v8qqBtFMgDSr0)

Perbedaan dari 2 stuktur di atas :

- Struktur data I datanya melebar, sedangkan struktur data II datanya memanjang.
- Struktur data I menggunakan Mata Pelajaran sebagai column, Rata-rata Waktu Belajar (menit) sebagai value, dan Tipe Ujian sebagai Index. Sedangkan struktur data II menggunakan Tipe Ujian sebagai identifier variable, Fisika, Matematika, Statistika sebagai value variable dan penamaan variable menjadi Mata Pelajaran dan value menjadi Rata-rata Waktu Belajar (menit).
- Jika ingin menganalisis data yang membutuhkan Fisika, Matematika, dan Statistika berada dalam satu kolom dengan Rata-rata Waktu Belajar di kolom lain, maka Struktur Data II adalah jawabannya. Begitu pula sebaliknya.

<h2>Soal 3: Reshaping Data 1</h2>

In [58]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}
df = pd.DataFrame(data)
df

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UTS1         Fisika                          486                 88
1        UAS1         Fisika                          355                 60
2        UTS2         Fisika                          560                 81
3        UAS2         Fisika                          261                 69
4        UTS1     Matematika                          305                 77
5        UAS1     Matematika                          612                 63
6        UTS2     Matematika                          598                 40
7        UAS2     Matematika                          719                 90
8        UTS1     Statistika                          229                 69
9        UAS1     Statistika                          446                 83
10       UTS2     Statistika                          512                 47
11       UAS2     Statistika                          271                 75

Perhatikan data di atas, kemudian ubahlah bentuknya agar sesuai yang di harapkan.

In [59]:
pivot_result = df.pivot_table(values = ['Rata2 Nilai Ujian', 'Rata2 Waktu Belajar (menit)'], index = 'Tipe Ujian', columns = 'Mata Pelajaran')

display(pivot_result)

               Rata2 Nilai Ujian                        \
Mata Pelajaran            Fisika Matematika Statistika
Tipe Ujian
UAS1                          60         63         83
UAS2                          69         90         75
UTS1                          88         77         69
UTS2                          81         40         47

               Rata2 Waktu Belajar (menit)
Mata Pelajaran                      Fisika Matematika Statistika
Tipe Ujian
UAS1                                   355        612        446
UAS2                                   261        719        271
UTS1                                   486        305        229
UTS2                                   560        598        512

Expected Result:

![alt text](https://drive.google.com/uc?id=1XufsfqZe7-XZLsb92SpATexy-QRZE0ow)

<h2>Soal 4: Reshaping Data 2</h2>

In [54]:
import pandas as pd

data = {
    'Hari' : ['Sabtu', 'Minggu'],
    'Kebun Binatang' : [271, 399],
    'Dufan' : [501, 700],
    'Disney' : [1000, 1001],
    'Bali' : [900, 803]
}
df = pd.DataFrame(data).set_index('Hari')
df

        Kebun Binatang  Dufan  Disney  Bali
Hari
Sabtu              271    501    1000   900
Minggu             399    700    1001   803

diatas adalah data tentang jumlah pengunjung di berbagai tempat hiburan, ubahlah struktur data tersebut sehingga sesuai dengan hasil yang diharapkan.

Expected Result:

![alt text](https://drive.google.com/uc?id=159mIqcyfeD30EEcyZmmkovORa6cZDLtn)

In [55]:
df = df.reset_index()

In [56]:
pd.melt(df, id_vars = ['Hari'], value_vars = ['Kebun Binatang', 'Dufan', 'Disney', 'Bali'], var_name = 'Tempat Hiburan', value_name = 'Pengunjung')

     Hari  Tempat Hiburan  Pengunjung
0   Sabtu  Kebun Binatang         271
1  Minggu  Kebun Binatang         399
2   Sabtu           Dufan         501
3  Minggu           Dufan         700
4   Sabtu          Disney        1000
5  Minggu          Disney        1001
6   Sabtu            Bali         900
7  Minggu            Bali         803

<h2>Soal 5: Pivoting and Aggregating</h2>

In [61]:
import pandas as pd

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1']*3,
    'Mata Pelajaran' :['Statistika', 'Fisika', 'Fisika', 'Statistika', 'Fisika', 'Statistika'],
    'Jumlah Peserta' : [14, 17, 12, 16, 14, 13]
}
df = pd.DataFrame(data).set_index('Tipe Ujian')
df

           Mata Pelajaran  Jumlah Peserta
Tipe Ujian
UTS1           Statistika              14
UAS1               Fisika              17
UTS1               Fisika              12
UAS1           Statistika              16
UTS1               Fisika              14
UAS1           Statistika              13

Perhatikan bahwa data jumlah peserta ujian untuk suatu tipe ujian dan mata pelajaran tertentu ada yang duplikat, ubahlah struktur data tersebut dan lakukan aggregasi berjenis jumlah sehingga sesuai dengan hasil yang di harapkan

Expected Result:

![alt text](https://drive.google.com/uc?id=1emoz7orYR-0mCHffvAgM8j-V1P6yVHf0)

In [62]:
result = df.pivot_table(values = 'Jumlah Peserta', index = 'Tipe Ujian', columns = 'Mata Pelajaran', aggfunc='sum')

display(result)

Mata Pelajaran  Fisika  Statistika
Tipe Ujian
UAS1                17          29
UTS1                26          14